
package cardgameexercise;


public interface CardGame {
    
    //Η απάντηση στην ερώτηση της άσκησης είναι ότι το πιο χρήσιμο στην προκειμένη περίπτωση είναι το Interface.
    //Γιατί μας δίνει την δυνατότητα να φτιάξουμε μεθόδους 
    //που θα χρησιμοποιηθούν αυτούσιες από τις κλάσεις που θα το κάνουν Implement
    
    //παράδειγμα μεθόδου που θα χρησιμοποιηθεί αυτούσια από κάθε κλάση
    public default void shuffle() {
        System.out.println("Shuffling the deck...");
    };
    
    //και ταυτόχρονα δίνει την δυνατότητα για abstract μεθόδους
    //που θα εφαρμοστούν με διαφορετικό τρόπο σε κάθε implementing κλάση
    
    //παραδείγματα μεθόδων που μπορούν να εφαρμοστούν διαφορειτκά από κάθε κλάση
    void deal();
    void displayRules();
    void keepScore();
}
